# =============================================================================
# Окружение: homelab
# Настройка backend для хранения Terraform state.
#
# State хранится ВНЕ репозитория (в /home/roman/infra-state/),
# потому что:
#   1. Может содержать чувствительные данные (в нашем случае — нет, но лучше не рисковать).
#   2. Файл .tfstate не должен попадать в git (в .gitignore его нет смысла выкладывать).
# =============================================================================

terraform {
  backend "local" {
    path = "/home/roman/infra-state/homelab/terraform.tfstate"
  }
}